{
    "001": "This field is mandatory for this request. Please specify a value and try again.",
    "002": "Only alphanumeric characters and punctuations (definition) are accepted.",
    "003": "Only alphanumeric characters (definition) and spaces are accepted.",
    "004": "Only alphanumeric characters (definition) are accepted.",
    "005": "Only alphanumeric characters (definition), dots and dashes are accepted.",
    "006": "Only Chinese characters and punctuation (definition) are accepted.",
    "007": "Only Chinese characters are accepted.",
    "008": "Only numerical values are accepted.",
    "009": "This field cannot only contain numeric characters.",
    "010": "Invalid value for this field. You can refer to our API reference for field requirements of this endpoint, or retrieve the API schema if it's a beneficiary field.",
    "011": "Invalid format for this field. You can refer to our API reference for field requirements of this endpoint, or retrieve the API schema if it's a beneficiary field.",
    "012": "This field cannot contain leading or trailing whitespace characters. Please remove and try again.",
    "013": "This field cannot contain whitespace characters. Please remove and try again.",
    "014": "This field cannot contain emojis. Please remove and try again.",
    "015": "Only positive numerical value is accepted.",
    "016": "The value in this field is invalid and can only be one of the acceptable value specified in the params object. value_options: the acceptable values for this field",
    "017": "The value in this field is invalid. Refer to the acceptable value as defined in the params object. value: acceptable value for this field",
    "018": "The number of characters in this field is higher/lower than the acceptable length. Please provide a value within the acceptable range as defined in the params object. length_min: minimum number of characters accepted for this field; length_max: maximum number of characters accepted for this field",
    "019": "The number of characters in this field is higher/lower than the acceptable length. Please provide a value in the length as defined in the params object. length: the exact number of characters accepted for this field",
    "020": "The number of characters in this field is lower than the acceptable length. Please provide a value longer than the minimum length as defined in the params object. length_min: minimum number of characters accepted for this field",
    "021": "The number of characters in this field is higher than the acceptable length. Please provide a value shorter than the maximum length in the params object. length_max: maximum number of characters accepted for this field",
    "022": "The number of characters in this field does not match the acceptable lengths. Please provide a value in the lengths as defined in the params object. length_options: the acceptable number of characters for this field",
    "023": "The number of metadata keys should be smaller than 15, and the total number of metadata characters should be smaller than 4500.",
    "024": "The field local_clearing_system is not applicable for SWIFT payment_method. Please remove this field and try again.",
    "025": "The date and time should be in the ISO 8601 format.",
    "026": "The date should be in the ISO 8601 format.",
    "027": "The date specified is invalid. Please provide a valid date not earlier than today and try again.",
    "028": "Post Office Box address is not accepted. Please provide a valid street address.",
    "029": "Provide a valid email address.",
    "030": "Provide a valid postcode for the selected country/region.",
    "031": "The account_currency does not match the payment_currency. Please ensure the payment currency is supported by the beneficiary account.",
    "032": "The SWIFT code / BIC specified does not match the bank country code provided. Please provide a valid SWIFT code / BIC and try again.",
    "033": "The SWIFT code / BIC specified is invalid.",
    "034": "Neither payment_amount nor source_amount is specified. Please specify a value for either one and try again.",
    "035": "The bank code specified is invalid.",
    "036": "The IBAN specified does not match the bank country code provided. Please provide a valid IBAN and try again.",
    "037": "The payment amount is above the maximum limit. Provide a lower amount than the limit included in the params object. amount_max: the maximum limit for this field; amount_max_currency: currency of the maximum amount limit",
    "038": "The payment amount is below the minimum limit. Provide a higher amount than the limit included in the params object. amount_min: the minimum limit for this field; amount_min_currency: currency of the minimum amount limit",
    "039": "The beneficiary bank detail specified is invalid. Please provide valid details and try again.",
    "040": "The payment method specified is unsupported for this beneficiary. Please select a valid payment method and try again.",
    "041": "Paper check payouts are not enabled for this account.",
    "042": "The decimal places in this field are more than the acceptable format. Please provide a value with decimals less than the max number of decimal places as defined in the params object. decimal_max: maximum number of decimal places accepted for this field",
    "043": "No payment method is supported for the selected payment currency and beneficiary bank country. You can retrieve our API schema to understand the supported regions and currencies specific to your account.",
    "044": "The payer ID specified is invalid. Please provide a valid ID of an existing payer and try again.",
    "045": "The beneficiary ID specified is invalid. Please provide a valid ID of an existing beneficiary and try again.",
    "046": "The request cannot contain values in both beneficiary ID and beneficiary object. Please only specify either one or the other and try again.",
    "047": "The request cannot contain values in both payer ID and payer object. Please only specify either one or the other and try again.",
    "048": "Payer specification is not supported. Please remove this field and try again.",
    "049": "The payer is under/over the age requirement per local regulations. Please provide a payer within the acceptable age range as defined in the params object. age_min: minimum age accepted for this field; age_max: maximum age accepted for this field",
    "050": "An unexpected error has occurred. Please contact the Account Manager or support@airwallex.com to troubleshoot the error.",
    "051": "The BPAY biller code specified is invalid. Please provide a valid biller code and try again.",
    "052": "The BPAY Customer Reference Number (CRN) specified should only contain numeric characters. Please remove any invalid characters such as \"-\" or spaces and try again.",
    "053": "The BPAY Customer Reference Number (CRN) specified is invalid for this Biller.",
    "054": "The length of the BPAY Customer Reference Number (CRN) specified is not acceptable for this Biller.",
    "055": "Only numeric values are accepted. Please remove any special characters such as \",\" or \"$\" and try again.",
    "056": "The payment amount specified is less than the minimum amount the Biller can accept. Check the Biller's requirement and provide a valid amount.",
    "057": "The payment amount specified is higher than the maximum amount the Biller can accept. Check the Biller's requirement and provide a valid amount.",
    "058": "The payment amount specified is incorrect and not accepted by the Biller. Check the Biller's requirement and provide a valid amount.",
    "059": "The payment date specified is invalid. Check the Biller's requirement and provide a valid date.",
    "060": "The personal identification number should consist of 8 numeric or 9 alphanumeric characters (definition).",
    "061": "The personal identification number should start with an \"E\" followed by up to 8 numeric characters.",
    "062": "This should be 4 digits, or 4 digits followed by 1 alphanumeric character (definition). You may include a hyphen.",
    "063": "This should be 4 digits.",
    "064": "This should be 4 digits, or 4 digits followed by a 1-digit suffix. You may include a hyphen.",
    "065": "This should be 4 digits, or 4 digits followed by a 1-2 alphanumeric character (definition) suffix. You may include a hyphen.",
    "066": "The number of digits should be the same as defined by length_1 in parameters, or length_2 digits followed by a 1-digit suffix. You may include a hyphen. length_1: the number of numeric digits accepted for this field; length_2: the number of numeric digits accepted for this field when followed by a 1-digit suffix (e.g., \"1\" or \"-1\")",
    "067": "This should be 8 digits followed by a 1-digit suffix. You may include a hyphen.",
    "068": "This should be 11 digits followed by a 1-digit suffix. You may include a period and a hyphen.",
    "069": "This should be 11 to 12 digits followed by a 1-digit suffix. You may include a period and a hyphen.",
    "070": "This should be 7 digits, or 7 digits followed by a 1-digit suffix. You may include a hyphen.",
    "071": "This should be 5 digits followed by a 1-digit suffix, or 7 digits followed by a 1-digit suffix. You may include a hyphen.",
    "072": "This should be 5 digits followed by a 2-digit suffix. You may include a hyphen.",
    "073": "The beneficiary is under/over the age requirement per local regulations. Please provide a beneficiary within the acceptable age range as defined in the params object. age_min: minimum age accepted for this field; age_max: maximum age accepted for this field",
    "074": "The ID number specified is invalid.",
    "075": "The bank account number specified is invalid for the corresponding bank. Please provide a valid bank account number and try again.",
    "076": "The bank account name should match the first and last name in Chinese.",
    "077": "The beneficiary cannot be a financial institution.",
    "078": "The fields do not match the registered information for the bank account specified. Please provide matching beneficiary name, ID, bank account number, and mobile number as registered on the bank account.",
    "079": "The fields do not match the registered information for the beneficiary specified. Please provide beneficiary business name, business registration number, and legal representative name as registered with the local authorities.",
    "080": "FX Forward currency conversion is unsupported for payouts to an account under the same name as yours.",
    "081": "FX Forward currency conversion is unsupported for payouts to your own account.",
    "082": "The branch code is invalid for the bank specified. Please provide a valid and supported branch code and try again.",
    "083": "The IBAN is invalid for the country specified. Please provide a valid IBAN and try again.",
    "084": "We are unable to validate this IBAN due to an unexpected error. Please try again later. If the problem persists, contact your Account Manager.",
    "085": "This is not a valid bank account with the beneficiary bank specified. Please provide a valid account number and try again.",
    "086": "The bank code specified within the bank account number is invalid or unsupported. Please check the leading digits as suggested in the params object and try again. The value of length within the params object represents the number of leading digits within the bank account number that stands for the bank code. length: the number of leading digits within the account number that stands for a bank code",
    "087": "The branch code specified within the bank account number is invalid or",
    "088": "The transit number is invalid for the financial institution specified. Please check and try again.",
    "089": "This IBAN b elongs to a bank that we currently do not support. Please try again with another bank's account, or contact your Account Manager."
}